/*
---------------------------------------------------------------
资源限制
时间限制：1.0s   内存限制：512.0MB
---------------------------------------------------------------
问题描述
　　编写一个程序，读入一组整数，这组整数是按照从小到大的顺序排列的，
它们的个数N也是由用户输入的，最多不会超过20。然后程序将对这个数组
进行统计，把出现次数最多的那个数组元素值打印出来。如果有两个元素值
出现的次数相同，即并列第一，那么只打印比较小的那个值。
---------------------------------------------------------------
　　输入格式：第一行是一个整数N，N £ 20；接下来有N行，每一行表示
一个整数，并且按照从小到大的顺序排列。
---------------------------------------------------------------
　　输出格式：输出只有一行，即出现次数最多的那个元素值。
---------------------------------------------------------------
输入输出样例
样例输入
5
100
150
150
200
250
---------------------------------------------------------------
样例输出
150
---------------------------------------------------------------
*/
#include<iostream>
using namespace std;
int n;
long long arr[20];
void solve(){
    int max=1;
    long long max_v=arr[0];
    long long current=arr[0];
    int count=1;
    
    for (int i = 1; i < n;i++)
    {
        if(arr[i]==current){
            count++;
        }else{
            if(count>max){
                max_v = arr[i-1];
                max = count;
            }
            current = arr[i];
            count = 1;
        }

    }
    if(count>max){
        max_v = arr[n - 1];
    }

    cout << max_v;
}
int main (){
    cin >> n;
    if(n<=0) return 0;

    for (int i = 0; i < n;i++)
    {
        cin >> arr[i];
    }
    solve();
    return 0;
}