/*
资源限制
时间限制：1.0s   内存限制：512.0MB
------------------------------------------------
问题描述
　　编写一个程序，输入3个整数，然后程序将对这三个整数
按照从大到小进行排列。
------------------------------------------------
　　输入格式：输入只有一行，即三个整数，中间用空格隔开。
------------------------------------------------
　　输出格式：输出只有一行，即排序后的结果。
　　输入输出样例
------------------------------------------------
样例输入
9 2 30
------------------------------------------------
样例输出
30 9 2
*/
#include<iostream>
using namespace std;
int a, b, c;
void solve(){
    if(a>b){
        if(b>=c){
            cout << a <<" "<< b <<" "<< c;
        }
        if(c>a){
            cout << c <<" "<< a <<" "<< b;
        }
        if(a>c && c>b){
            cout << a <<" "<< c <<" "<< b;
        }
    }else{
        if(a>=c){
            cout << b <<" "<< a <<" "<< c;
        }
        if(c>b){
            cout << c <<" "<< b <<" "<< a;
        }
        if(b>c && c>a){
            cout << b <<" "<< c <<" "<< a;
        }
    }
}
int main (){
    cin >> a >> b >> c;
    solve();
    return 0;
}